## Pandas

### Instructions

This assignment will be done completely inside this Jupyter notebook with answers placed in the cell provided.

All python imports that are needed shown.

Follow all the instructions in this notebook to complete these tasks.    

Make sure the CSV data files is in the same folder as this notebook - alumni.csv, groceries.csv

In [103]:
# Imports needed to complete this exam
import pandas as pd

### Question 1 :  Import CSV file (1 Mark)


Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

In [104]:
df = pd.read_csv("alumni.csv")

### Question 2 :  Understand the data set (5 Marks)

Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

In [105]:
df.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [106]:
df.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [107]:
df.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [109]:
df.describe()

       Year Graduated         Salary           Fee
count       88.000000      88.000000     88.000000
mean      2006.477273   84090.909091  11708.727273
std          1.560852   21234.128008   1110.647949
min       2004.000000   35000.000000  10869.000000
25%       2005.000000   75000.000000  10968.000000
50%       2006.500000   75000.000000  11696.000000
75%       2008.000000   90000.000000  12058.250000
max       2009.000000  160000.000000  20960.000000

### Question 3 :  Working with the data set (4)

a) get the median, b) mean and c) standard deviation for the 'Salary' column

In [110]:
df['Salary'].median()

np.float64(75000.0)

In [111]:
df['Salary'].mean().round(3)

np.float64(84090.909)

In [112]:
df['Salary'].std().round(3)

np.float64(21234.128)

# Select row at index 3

In [113]:
df.iloc[3,:]

Year Graduated                2007
Gender                        Male
Marital Status             Married
Diploma Type      Standard Diploma
Defaulted                       No
Salary                      120000
Fee                          10869
Savings ($)                $76,000
Name: 3, dtype: object

# Select rows with over 70,000 on the salary

In [114]:
df.loc[df['Salary']>70000,:]

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"
6,2006,Male,Divorced,Standard Diploma,No,160000,11724,"$120,000"
...,...,...,...,...,...,...,...,...
81,2005,Female,Single,Standard Diploma,Yes,90000,12066,"$16,000"
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

# Update coulmn values in Marital Status to a charcheter crossponding it's value
for example Single ->S ,Married->M and so on

In [115]:
df['Marital Status'].unique()

array(['Single', 'Married', 'Divorced'], dtype=object)

In [116]:
values = { 'Single' : 'S', 'Married' : 'M','Divorced' : 'D' }
df['Marital Status'].replace(values , inplace=True)
df

C:\Users\habib\AppData\Local\Temp\ipykernel_8556\2567127560.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Marital Status'].replace(values , inplace=True)

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,S,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,M,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,S,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,M,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,D,Standard Diploma,Yes,95000,11948,"$52,000"
...,...,...,...,...,...,...,...,...
83,2007,Male,S,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,S,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,M,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,D,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,M,Standard Diploma,Yes,75000,12067,"$67,000"

# Drop the Fee coulmn

In [117]:
df = df.drop('Fee',axis=1)
df

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Savings ($)
0,2004,Male,S,Standard Diploma,Yes,125000,"$86,000"
1,2005,Male,M,College Prep Diploma,No,100000,"$116,000"
2,2006,Female,S,Standard Diploma,Yes,70000,"$52,000"
3,2007,Male,M,Standard Diploma,No,120000,"$76,000"
4,2006,Female,D,Standard Diploma,Yes,95000,"$52,000"
...,...,...,...,...,...,...,...
83,2007,Male,S,Standard Diploma,No,75000,"$16,000"
84,2008,M,S,College Prep Diploma,Yes,65000,"$72,000"
85,2009,Male,M,Standard Diploma,No,75000,"$46,000"
86,2005,Female,D,Standard Diploma,Yes,100000,"$32,000"
87,2006,Male,M,Standard Diploma,Yes,75000,"$67,000"

# ADD a New row to the data set

In [118]:
df.loc[len(df)]=(2009,"Female",'S',"Standard Diploma",	"Yes ",7500,"$67,000")
df.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Savings ($)
84,2008,M,S,College Prep Diploma,Yes,65000,"$72,000"
85,2009,Male,M,Standard Diploma,No,75000,"$46,000"
86,2005,Female,D,Standard Diploma,Yes,100000,"$32,000"
87,2006,Male,M,Standard Diploma,Yes,75000,"$67,000"
88,2009,Female,S,Standard Diploma,Yes,7500,"$67,000"

# Remove all rows where year geaduated is under 2006

In [119]:
df = df[~ (df['Year Graduated']<2006)]
df.describe()

       Year Graduated         Salary
count       62.000000      62.000000
mean      2007.338710   82540.322581
std          1.070369   24312.227644
min       2006.000000    7500.000000
25%       2006.000000   71250.000000
50%       2007.000000   75000.000000
75%       2008.000000   90000.000000
max       2009.000000  160000.000000